Revit 2022 API
AnalyticalModelSurface.ProjectionPlaneZ Property
 The Z projection option.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2015
Syntax
C#
public ElementId ProjectionPlaneZ { get; set; }
Visual Basic
Public Property ProjectionPlaneZ As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ ProjectionPlaneZ {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Retrieves and set analytical model projection plane information for Z direction. If analytical model is projected to characteristic location, like center of core, then invalidElementId is returned. Use ProjectionZ property to determine if analytical model is projected to characteristic location or level, grid or ref plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: Plane is invalid projection target.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalyticalModelSurface Class
Autodesk.Revit.DB.Structure Namespace